* Git

** Install

   To install, include the appropriate file in =~/.gitconfig=:

 	 #+begin_src conf
     [include]
     path = ~/dotfiles/git/windows10.conf
     path = ~/dotfiles/git/linux.conf
     path = ~/dotfiles/git/macos.conf
    #+end_src

   
** Supported Operating Systems

   There are customisations for different operating systems:

   #+begin_src shell :exports both
     ls ./git/*.conf
   #+end_src

   #+RESULTS:
   | ./git/common.conf    |
   | ./git/linux.conf     |
   | ./git/macos.conf     |
   | ./git/windows10.conf |
 
 
 
